src/config/Documents/ЭлектронноеПисьмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЭлектронноеПисьмо</Name>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмо</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПисьмаЭлектроннойПочты</xr:Item>
				<xr:Item>InformationRegister.ПредметыЭлектронныхПисем</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомуПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительАдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопииПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытыеКопии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаУчетнойЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТранспорта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТекстаПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассмотретьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переадресация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовоеСообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПотомкаПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПотомковЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаРедактированияХТМЛТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютераРедактированияХТМЛТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КомуТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КопииТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкрытыеКопииТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/ПисьмаЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПисьмаЭлектроннойПочты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоНеРассмотрено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧерновики</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаУчетнойЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГраницаПрочитанности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/InformationRegisters/ПредметыЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ПредметыЭлектронныхПисем</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Скрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаПисемЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Enums/СтатусыПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Полученное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправленное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сохраненное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/ВидыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/СостоянияПотомковЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостоянияПотомковЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтветСохранен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереадресацияСохранена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереадресацияОтправлена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Catalogs/ВложенияЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ВложенияЭлектронныхПисем</Name>
			<Comment>Вложения электронных писем</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДФайлаПочтовогоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/Documents/ЭлектронноеПисьмо/Ext/ObjectModule.bsl
Перем мЭтоНовый;

Перем мОбъектКопирования Экспорт;

Перем мСтруктураДоступа Экспорт;

Перем НеВыдаватьСообщенияПриЗаписиОбъекта Экспорт;

Перем мРежимБезЗаписи Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ЗменитьЗапрещенныеСимволыИмени(ИмяФайла)

	Если Найти(ИмяФайла,  "\") > 0 Тогда
		ИмяФайла = СтрЗаменить(ИмяФайла, "\", " ");
	КонецЕсли;
	Если Найти(ИмяФайла,  "/") > 0 Тогда
		ИмяФайла = СтрЗаменить(ИмяФайла, "/", " ");
	КонецЕсли;
	Если Найти(ИмяФайла,  ":") > 0 Тогда
		ИмяФайла = СтрЗаменить(ИмяФайла, ":", " ");
	КонецЕсли;
	Если Найти(ИмяФайла,  "*") > 0 Тогда
		ИмяФайла = СтрЗаменить(ИмяФайла, "*", " ");
	КонецЕсли;
	Если Найти(ИмяФайла,  "?") > 0 Тогда
		ИмяФайла = СтрЗаменить(ИмяФайла, "?", " ");
	КонецЕсли;
	Если Найти(ИмяФайла, """") > 0 Тогда
		ИмяФайла = СтрЗаменить(ИмяФайла, """", " ");
	КонецЕсли;
	Если Найти(ИмяФайла,  "<") > 0 Тогда
		ИмяФайла = СтрЗаменить(ИмяФайла, "<", " ");
	КонецЕсли;
	Если Найти(ИмяФайла,  ">") > 0 Тогда
		ИмяФайла = СтрЗаменить(ИмяФайла, ">", " ");
	КонецЕсли;
	Если Найти(ИмяФайла,  "|") > 0 Тогда
		ИмяФайла = СтрЗаменить(ИмяФайла, "|", " ");
	КонецЕсли;

КонецПроцедуры

#Если Клиент Тогда

Функция ЗахватитьТекст() Экспорт
	
	ИмяФайла = "Электронное письмо " + СокрЛП(Номер) + ?(НЕ ЗначениеНеЗаполнено(Тема), (" (" + СокрЛП(Тема) + ")"), "");
	ЗменитьЗапрещенныеСимволыИмени(ИмяФайла);
	Если СтрДлина(ИмяФайла) > 256 Тогда
		ИмяФайла = Лев(ИмяФайла, 256);
	КонецЕсли; 
	
	ИмяСохраненияФайла = ПолучитьИмяФайла(ПолучитьИмяКаталога(глТекущийПользователь), (ИмяФайла + ".HTM"));
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстПисьма);
	Попытка
		ТекстовыйДокумент.Записать(ИмяСохраненияФайла);
	Исключение
		СообщитьОбОшибке(ОписаниеОшибки(),, "Не удалось сохранить файл на диск!");
		Возврат Ложь;
	КонецПопытки;
	
	Если НЕ ОткрытьФайлДляРедактированияВнешнимХТМЛРедактором(ИмяСохраненияФайла) Тогда
		Файл = Новый Файл(ИмяСохраненияФайла);
		Если Файл.Существует() Тогда
			УдалитьФайлы(ИмяСохраненияФайла);
		КонецЕсли; 
		Возврат Ложь;
	КонецЕсли; 
	
	ИмяФайлаРедактированияХТМЛТекста      = ИмяСохраненияФайла;
	ИмяКомпьютераРедактированияХТМЛТекста = ИмяКомпьютера();
	
	ТекстПисьма = "<HTML><HEAD>
	|<META http-equiv=Content-Type content=""" + "text/html; charset=utf-8""" + ">
	|<META content=""" + "MSHTML 6.00.2800.1458""" + " name=GENERATOR></HEAD>
	|<BODY>
	|<P>Текст данного письма редактируется внешним редактором HTML текстов.</P>
	|<P><A href=""" + "ИмяФайлаРедактированияХТМЛТекста" + """>Перейдите по гиперссылке для начала редактирования.</A></P>
	|<P>(" + ИмяФайлаРедактированияХТМЛТекста + ")</A></P>
	|</BODY></HTML>";
	
	Возврат Истина;
	
КонецФункции

Процедура ОсвободитьТекст() Экспорт

	Если ИмяКомпьютера() <> ИмяКомпьютераРедактированияХТМЛТекста Тогда
		Сообщить("Файл редактируется на копмьютере""" + ИмяКомпьютераРедактированияХТМЛТекста + """" + ". Редактирование на текущем комьютере невозможно.");
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	Попытка
		ТекстовыйДокумент.Прочитать(ИмяФайлаРедактированияХТМЛТекста);
	Исключение
		СообщитьОбОшибке(ОписаниеОшибки(),, "Файл редактирования не удалось открыть.");
		Возврат;
	КонецПопытки;
	
	ТекстПисьма = ТекстовыйДокумент.ПолучитьТекст();
	
	Если НЕ ЗначениеНеЗаполнено(ИмяФайлаРедактированияХТМЛТекста) И ЗначениеНеЗаполнено(Ссылка.ИмяФайлаРедактированияХТМЛТекста) Тогда
		Попытка
			УдалитьФайлы(ИмяФайлаРедактированияХТМЛТекста);
		Исключение
		КонецПопытки;
	КонецЕсли; 

	ИмяКомпьютераРедактированияХТМЛТекста = "";
	ИмяФайлаРедактированияХТМЛТекста      = "";

КонецПроцедуры

#КонецЕсли

// Процедура заполняет группу по умолчанию у нового письма.
//
Процедура УказатьГруппуПоУмолчанию() Экспорт

	Если ЗначениеНеЗаполнено(ГруппаУчетнойЗаписи) ИЛИ ГруппаУчетнойЗаписи.Владелец <> УчетнаяЗапись Тогда
		ГруппаУчетнойЗаписи = УчетнаяЗапись.ГруппаИсходящие;
	КонецЕсли; 
	
КонецПроцедуры

// Процедура инициирует отправку письма.
//
Процедура ОтправитьПисьмо(ФормаПисьма = Неопределено) Экспорт

	ШапкаСообщения = "Не отправлено: " + Строка(ЭтотОбъект);
	
	Если СтатусПисьма = Перечисления.СтатусыПисем.Полученное ИЛИ СтатусПисьма = Перечисления.СтатусыПисем.Отправленное Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Кому) Тогда
		СообщитьОбОшибке("Не указан ни один получатель.",, ШапкаСообщения);
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		СообщитьОбОшибке("Нельзя отправлять помеченное на удаление письмо.",, ШапкаСообщения);
		Возврат;
	КонецЕсли;
	
	СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
	Если ЗначениеНеЗаполнено(Ответственный) Тогда
		Ответственный = глТекущийПользователь;
	КонецЕсли; 
	
	Если ФормаПисьма <> Неопределено Тогда
		Попытка
			ФормаПисьма.ЗаписатьВФорме();
			ФормаПисьма.Закрыть();
		Исключение
			СообщитьОбОшибке(ОписаниеОшибки(),, ШапкаСообщения);
			Возврат;
		КонецПопытки;
	Иначе
		Попытка
			ЭтотОбъект.Записать();
		Исключение
			СообщитьОбОшибке(ОписаниеОшибки(),, ШапкаСообщения);
			Возврат;
		КонецПопытки;
	КонецЕсли; 
	
	Если ПолучитьДоступныеУчетныеЗаписи(глТекущийПользователь).Транспорт.НайтиПоЗначению(УчетнаяЗапись) <> Неопределено Тогда
		УчетныеЗаписи = Новый Массив;
		УчетныеЗаписи.Добавить(УчетнаяЗапись);
		Письма = Новый Массив;
		Письма.Добавить(Ссылка);
		ПолучениеОтправкаПисем(глСоответствиеТекстовЭлектронныхПисем, глТекущийПользователь, УчетныеЗаписи, Письма, Истина);
	КонецЕсли;

КонецПроцедуры

// <Описание функции>
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   – <описание возвращаемого значения>
//
Функция СтрокаТаблицы(Значение1, Значение2)

	СтрокаВозврата = "<TR>
	|<TD class=R0C0>" + Значение1 + "</TD>
	|<TD class=R0C1><STRONG>" + Значение2 + "</STRONG></TD>
	|<TD>&nbsp;</TD></TR>";
	
	Возврат СтрокаВозврата;

КонецФункции // СтрокаТаблицы("Дата создания", Строка(Дата))()

// <Описание функции>
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   – <описание возвращаемого значения>
//
Функция ПредставлениеСтрокиДляHTML(ИсходнаяСтрока)

	СтрокаВозврата = ИсходнаяСтрока;
	
	СтрокаВозврата = СтрЗаменить(СтрокаВозврата, "<", "&lt;");
	СтрокаВозврата = СтрЗаменить(СтрокаВозврата, ">", "&gt;");
	
	Возврат СтрокаВозврата;

КонецФункции // ПредставлениеСтрокиДляHTML()

Процедура НапечататьПисьмо() Экспорт

	ТекстОписанияЭлектронногоПисьма = "Электронное письмо № " + СокрЛП(Номер) + ", " + Дата + "<BR>" + ПредставлениеСтрокиДляHTML((СокрЛП(УчетнаяЗапись) + " <" + УчетнаяЗапись.АдресЭлектроннойПочты + ">"));
	
	ТекстВыходногоДокумента = "<HTML><HEAD>
	|<META http-equiv=Content-Type content="+""""+"text/html; charset=utf-8" +"""" +  ">
	|<META content=" + """" + "MSHTML 6.00.2800.1458" + """" + " name=GENERATOR></HEAD>
	|<BODY>
	|<H3 class=" + """" + """" + ">" + ТекстОписанияЭлектронногоПисьма + "</H2>
	|<HR>
	|<TABLE cellSpacing=0>
	|<TBODY>
	|<TR class=invisible>
	|<TD width=250></TD>
	|<TD width=460></TD>
	|<TD></TD></TR>
	|";
	
	ТекстВыходногоДокумента = ТекстВыходногоДокумента + СтрокаТаблицы("Дата создания:", Строка(Дата));
	ТекстВыходногоДокумента = ТекстВыходногоДокумента + СтрокаТаблицы("Дата отправления:", Строка(ДатаОтправления));
	ТекстВыходногоДокумента = ТекстВыходногоДокумента + СтрокаТаблицы("Отправитель:", ПредставлениеСтрокиДляHTML(ОтправительПредставление));
	
	Если КомуТЧ.Количество() > 0 Тогда
		ТекстВыходногоДокумента = ТекстВыходногоДокумента + СтрокаТаблицы("Получатели:", ПредставлениеСтрокиДляHTML((КомуТЧ[0].Представление + " <" + КомуТЧ[0].АдресЭлектроннойПочты + ">")));
		Для а = 1 По КомуТЧ.Количество() - 1 Цикл
			ТекстВыходногоДокумента = ТекстВыходногоДокумента + СтрокаТаблицы("", ПредставлениеСтрокиДляHTML((КомуТЧ[а].Представление + " <" + КомуТЧ[а].АдресЭлектроннойПочты + ">")));
		КонецЦикла; 
	КонецЕсли;
	
	Если КопииТЧ.Количество() > 0 Тогда
		ТекстВыходногоДокумента = ТекстВыходногоДокумента + СтрокаТаблицы("Копии:", ПредставлениеСтрокиДляHTML((КопииТЧ[0].Представление + " <" + КопииТЧ[0].АдресЭлектроннойПочты + ">")));
		Для а = 1 По КопииТЧ.Количество() - 1 Цикл
			ТекстВыходногоДокумента = ТекстВыходногоДокумента + СтрокаТаблицы("", ПредставлениеСтрокиДляHTML((КопииТЧ[а].Представление + " <" + КопииТЧ[а].АдресЭлектроннойПочты + ">")));
		КонецЦикла; 
	КонецЕсли;
	
	ТекстВыходногоДокумента = ТекстВыходногоДокумента + СтрокаТаблицы("Тема:", ПредставлениеСтрокиДляHTML(Тема));
	
	Если НЕ ЗначениеНеЗаполнено(Предмет) Тогда
		ТекстВыходногоДокумента = ТекстВыходногоДокумента + СтрокаТаблицы("Предмет:", ПредставлениеСтрокиДляHTML(Строка(Предмет)));
	КонецЕсли; 
	
	Если НЕ ЗначениеНеЗаполнено(Ответственный) Тогда
		ТекстВыходногоДокумента = ТекстВыходногоДокумента + СтрокаТаблицы("Ответственный:", ПредставлениеСтрокиДляHTML(Строка(Ответственный)));
	КонецЕсли;
	
	ТекстВыходногоДокумента = ТекстВыходногоДокумента + "</TBODY></TABLE>
	|";
	
	ТекстВыходногоДокумента = ТекстВыходногоДокумента + "<HR>
	|";
	
	
	ТекстПисьмаДляПечати = ТекстПисьма;
	Если ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
		НовыйHTMLДокумент = Новый COMОбъект("HtmlFile");
		НовыйHTMLДокумент.open("text/html");
		НовыйHTMLДокумент.write(ТекстПисьмаДляПечати);
		НовыйHTMLДокумент.close();
		ТегBODY = НовыйHTMLДокумент.all.Tags("BODY");
		Если ТегBODY.length > 0 Тогда
			ТекстПисьмаДляПечати = НовыйHTMLДокумент.all.Tags("Body").item(0).innerHTML;
		КонецЕсли;
	Иначе
		ТекстПисьмаДляПечати = СтрЗаменить(ТекстПисьмаДляПечати, Символы.ПС, "<BR>");
	КонецЕсли;
	
	ТекстВыходногоДокумента = ТекстВыходногоДокумента + "<P>" + ТекстПисьмаДляПечати + "</P>
	|<HR>
	|<P>
	|<TABLE cellSpacing=0>
	|<TBODY>
	|<TR class=invisible>
	|<TD width=250></TD>
	|<TD width=460></TD>
	|<TD></TD></TR>
	|<TR>
	|<TD class=R0C0>Напечатано:</TD>
	|<TD class=R0C1><STRONG>" + Строка(ТекущаяДата()) + "</STRONG></TD>
	|<TD>&nbsp;</TD></TR></TBODY></TABLE></P></BODY></HTML>";

	ФормаПечати = ПолучитьФорму("ФормаПечати");
	ФормаПечати.ЭлементыФормы.ПолеHTMLДокумента.УстановитьТекст(ТекстВыходногоДокумента);
	ФормаПечати.Заголовок = Строка(ЭтотОбъект);
	ФормаПечати.Открыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Процедура - обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ОбменДанными.Загрузка Тогда
	
		Если мРежимБезЗаписи Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		РассмотретьПосле = НачалоМинуты(РассмотретьПосле);
		
		мЭтоНовый = ЭтоНовый();
		
		Транспорт = мСтруктураДоступа.Транспорт;
		Отправка  = мСтруктураДоступа.Отправка;
		
		ШапкаСообщения = "Не записано: " + Строка(ЭтотОбъект);
		
		Если ЗначениеНеЗаполнено(УчетнаяЗапись) Тогда
			Если НЕ НеВыдаватьСообщенияПриЗаписиОбъекта Тогда
				СообщитьОбОшибке("Не указана учетная запись.",, ШапкаСообщения);
			КонецЕсли; 
			Отказ = Истина;
		КонецЕсли;
		
		Если СтатусПисьма = Перечисления.СтатусыПисем.Полученное Тогда
			Если ЗначениеНеЗаполнено(Ответственный) И НЕ НеРассмотрено Тогда
				НеРассмотрено = Истина;
			КонецЕсли;
		ИначеЕсли СтатусПисьма = Перечисления.СтатусыПисем.Отправленное Тогда
			Если ЭтоНовый() Тогда
				Если ЗначениеНеЗаполнено(Ответственный) Тогда
					Ответственный = глТекущийПользователь;
				КонецЕсли;
			Иначе
				Если Ответственный <> Ссылка.Ответственный Тогда
					Если НЕ НеВыдаватьСообщенияПриЗаписиОбъекта Тогда
						СообщитьОбОшибке("Нельзя менять ответственного в отправленном электронном письме.",, ШапкаСообщения);
					КонецЕсли; 
					Отказ = Истина;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		
		// В группу Удаленные и Черновики нельзя записывать письма
		ГруппаУдаленные = мСтруктураДоступа.ГруппыУдаленные.Получить(УчетнаяЗапись);
		Если ГруппаУчетнойЗаписи = ГруппаУдаленные Тогда
			Если НЕ НеВыдаватьСообщенияПриЗаписиОбъекта Тогда
				СообщитьОбОшибке(("Нельзя выбирать в качестве группы письма группу """ + ГруппаУдаленные + """, потому что она предназначена только для отображения удаленных писем."),, ШапкаСообщения);
			КонецЕсли; 
			Отказ = Истина;
		КонецЕсли;
		
		ГруппаЧерновики = мСтруктураДоступа.ГруппыЧерновики.Получить(УчетнаяЗапись);
		Если ГруппаУчетнойЗаписи = ГруппаЧерновики Тогда
			Если НЕ НеВыдаватьСообщенияПриЗаписиОбъекта Тогда
				СообщитьОбОшибке(("Нельзя выбирать в качестве группы письма группу """ + ГруппаЧерновики + """, потому что она предназначена только для отображения черновиков писем."),, ШапкаСообщения);
			КонецЕсли; 
			Отказ = Истина;
		КонецЕсли; 
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		КомуПредставление = "";
		Для каждого СтрокаКому Из КомуТЧ Цикл
			КомуПредставление = КомуПредставление + ", " + ?(ПустаяСтрока(СтрокаКому.Представление), СтрокаКому.АдресЭлектроннойПочты, СтрокаКому.Представление);
		КонецЦикла;
		Если НЕ ПустаяСтрока(КомуПредставление) Тогда
			КомуПредставление = Сред(КомуПредставление, 3);
		КонецЕсли; 
		
		КопииПредставление = "";
		Для каждого СтрокаКопии Из КопииТЧ Цикл
			КопииПредставление = КопииПредставление + ", " + ?(ПустаяСтрока(СтрокаКопии.Представление), СтрокаКопии.АдресЭлектроннойПочты, СтрокаКопии.Представление);
		КонецЦикла; 
		Если НЕ ПустаяСтрока(КопииПредставление) Тогда
			КопииПредставление = Сред(КопииПредставление, 3);
		КонецЕсли; 
		
		Если УчетнаяЗапись.ЗаполнятьПустойПредметДляНовыхПисемИзТемыПисьма И ЭтоНовый() И ЗначениеНеЗаполнено(Предмет) Тогда
			Предмет = Тема;
		КонецЕсли; 
		
		Если ЗначениеНеЗаполнено(СтатусПисьма) Тогда
			СтатусПисьма = Перечисления.СтатусыПисем.Сохраненное;
		КонецЕсли; 
		
		Если СтатусПисьма <> Перечисления.СтатусыПисем.Полученное Тогда
			ОтправительИмя                   = УчетнаяЗапись.Наименование;
			ОтправительАдресЭлектроннойПочты = УчетнаяЗапись.АдресЭлектроннойПочты;
		КонецЕсли; 
		
		Если ПустаяСтрока(ОтправительПредставление) Тогда
			Если НЕ ПустаяСтрока(УчетнаяЗапись.Наименование) И ПустаяСтрока(УчетнаяЗапись.АдресЭлектроннойПочты) Тогда
				ОтправительПредставление = УчетнаяЗапись.Наименование;
			ИначеЕсли ПустаяСтрока(УчетнаяЗапись.Наименование) И НЕ ПустаяСтрока(УчетнаяЗапись.АдресЭлектроннойПочты) Тогда
				ОтправительПредставление = УчетнаяЗапись.АдресЭлектроннойПочты;
			Иначе
				ОтправительПредставление = УчетнаяЗапись.Наименование + " <" + УчетнаяЗапись.АдресЭлектроннойПочты + ">";
			КонецЕсли; 
		КонецЕсли;
		
		Если ПустаяСтрока(ОтправительИмя) Тогда
			ОтправительИмя = ОтправительАдресЭлектроннойПочты;
		КонецЕсли; 
		
		Если ЗначениеНеЗаполнено(Предмет) Тогда
			Предмет = "";
		КонецЕсли; 
		
		Если НЕ ЭтоНовый() Тогда
		
			Выборка = Справочники.ВложенияЭлектронныхПисем.Выбрать(,, Новый Структура("Объект", Ссылка));
			
			НаличиеВложенийКартинок = Ложь;
			ЕстьВложения = Ложь;
			
			НайденноеСоответствие = глСоответствиеТекстовЭлектронныхПисем.Получить(Ссылка);
			
			ТаблицаКартинок = Новый ТаблицаЗначений;
			ТаблицаКартинок.Колонки.Добавить("Данные");
			ТаблицаКартинок.Колонки.Добавить("ИмяФайла");
			ТаблицаКартинок.Колонки.Добавить("ИДФайлаПочтовогоПисьма");
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ПометкаУдаления <> ПометкаУдаления Тогда
					Объект = Выборка.ПолучитьОбъект();
					Попытка
						Объект.УстановитьПометкуУдаления(ПометкаУдаления);
					Исключение
					КонецПопытки;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(Выборка.ИДФайлаПочтовогоПисьма) Тогда
					НаличиеВложенийКартинок = Истина;
					Если НайденноеСоответствие = Неопределено Тогда
						НоваяСтрокаТЗ = ТаблицаКартинок.Добавить();
						НоваяСтрокаТЗ.Данные                 = Выборка.Хранилище;
						НоваяСтрокаТЗ.ИДФайлаПочтовогоПисьма = Выборка.ИДФайлаПочтовогоПисьма;
					КонецЕсли;
				Иначе
					ЕстьВложения = Истина;
				КонецЕсли; 
			
			КонецЦикла;
			
			Если НайденноеСоответствие = Неопределено И ТаблицаКартинок.Количество() > 0 Тогда
				КопияТекстаПисьма = ТекстПисьма;
				ПропарситьHTMLИДВ_ТекстКартинки(глСоответствиеТекстовЭлектронныхПисем, глТекущийПользователь, ТаблицаКартинок, КопияТекстаПисьма);
				глСоответствиеТекстовЭлектронныхПисем.Вставить(Ссылка, КопияТекстаПисьма);
			КонецЕсли; 
			
			Если ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML ИЛИ ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
				Если НаличиеВложенийКартинок = Истина Тогда
					ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками;
				Иначе
					ВидТекстаПисьма = Перечисления.ВидыТекстовЭлектронныхПисем.HTML;
				КонецЕсли; 
			КонецЕсли;
			
			Если ЗначениеНеЗаполнено(ИмяФайлаРедактированияХТМЛТекста) И НЕ ЗначениеНеЗаполнено(Ссылка.ИмяФайлаРедактированияХТМЛТекста) Тогда
				Попытка
					УдалитьФайлы(Ссылка.ИмяФайлаРедактированияХТМЛТекста);
				Исключение
				КонецПопытки;
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	мОбъектКопирования = ОбъектКопирования.Ссылка;
	
КонецПроцедуры

// Процедура - обработчик события "ПриЗаписи" объекта.
//
Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
	
		ШапкаСообщения = "Не записано: " + Строка(ЭтотОбъект);
		
		// Запишем потомственность писем
		Если НЕ ЗначениеНеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронноеПисьмо") Тогда
		
			Если Ответ ИЛИ Переадресация Тогда
				
				СостояниеПотомка = Перечисления.СостоянияПотомковЭлектронныхПисем.ПустаяСсылка();
				Если СтатусПисьма = Перечисления.СтатусыПисем.Отправленное Тогда
					Если Ответ Тогда
						СостояниеПотомка = Перечисления.СостоянияПотомковЭлектронныхПисем.ОтветОтправлен;
					Иначе
						СостояниеПотомка = Перечисления.СостоянияПотомковЭлектронныхПисем.ПереадресацияОтправлена;
					КонецЕсли; 
				ИначеЕсли СтатусПисьма = Перечисления.СтатусыПисем.Исходящее ИЛИ СтатусПисьма = Перечисления.СтатусыПисем.Сохраненное Тогда
					Если Ответ Тогда
						СостояниеПотомка = Перечисления.СостоянияПотомковЭлектронныхПисем.ОтветСохранен;
					Иначе
						СостояниеПотомка = Перечисления.СостоянияПотомковЭлектронныхПисем.ПереадресацияСохранена;
					КонецЕсли; 
				КонецЕсли;
				
				ОбъектОснование = Основание.ПолучитьОбъект();
				ОбъектОснование.СостояниеПотомкаПисьма = СостояниеПотомка;
				
				Если Основание.НеРассмотрено
				   И УчетнаяЗапись.АвтоматическаяУстановкаПометкиРассмотреноПриОтвете
				   И СтатусПисьма = Перечисления.СтатусыПисем.Отправленное
				   И Ответ Тогда
					Если ЗначениеНеЗаполнено(ОбъектОснование.Ответственный) Тогда
						ОбъектОснование.Ответственный = глТекущийПользователь;
					КонецЕсли; 
					ОбъектОснование.НеРассмотрено = Ложь;
				КонецЕсли; 
				
				Попытка
					ОбъектОснование.Записать();
				Исключение
				КонецПопытки;
				
			Иначе
				
				Если Основание.НеРассмотрено
				   И УчетнаяЗапись.АвтоматическаяУстановкаПометкиРассмотреноПриПолученииОтвета
				   И СтатусПисьма = Перечисления.СтатусыПисем.Полученное
				   И мЭтоНовый Тогда
				
					ОбъектОснование = Основание.ПолучитьОбъект();
					Если ЗначениеНеЗаполнено(ОбъектОснование.Ответственный) Тогда
						ОбъектОснование.Ответственный = глТекущийПользователь;
					КонецЕсли; 
					ОбъектОснование.НеРассмотрено = Ложь;
					Попытка
						ОбъектОснование.Записать();
					Исключение
					КонецПопытки;
					
				КонецЕсли; 
				
			КонецЕсли;
		
		КонецЕсли; 
		
		ГруппаУдаленные = УчетнаяЗапись.ГруппаУдаленные;
		ГруппаЧерновики = УчетнаяЗапись.ГруппаЧерновики;
		
		Если ПометкаУдаления И НЕ ЗначениеНеЗаполнено(ГруппаУдаленные) Тогда
			ТекГруппа = ГруппаУдаленные;
		ИначеЕсли НЕ ПометкаУдаления И НЕ ЗначениеНеЗаполнено(ГруппаЧерновики) И СтатусПисьма = Перечисления.СтатусыПисем.Сохраненное Тогда
			ТекГруппа = ГруппаЧерновики;
		Иначе
			ТекГруппа = ГруппаУчетнойЗаписи;
		КонецЕсли; 
		
		// Записи регистра для подсчета количества не рассмотренных писем
		Набор = Движения.ПисьмаЭлектроннойПочты;
		Набор.Прочитать();
		Набор.Очистить();
		
		Запись = Набор.Добавить();
		Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
		Запись.КоличествоЧерновики = 0;
		Если ПометкаУдаления И НЕ ЗначениеНеЗаполнено(ГруппаУдаленные) Тогда
			Запись.ГруппаУчетнойЗаписи = ГруппаУдаленные;
		ИначеЕсли НЕ ПометкаУдаления И НЕ ЗначениеНеЗаполнено(ГруппаЧерновики) И СтатусПисьма = Перечисления.СтатусыПисем.Сохраненное Тогда
			Запись.ГруппаУчетнойЗаписи = ГруппаЧерновики;
			Запись.КоличествоЧерновики = 1;
		Иначе
			Запись.ГруппаУчетнойЗаписи = ГруппаУчетнойЗаписи;
		КонецЕсли; 
		Если УчетнаяЗапись.ИспользоватьКлассификациюПисемПоПредметам И НЕ ЗначениеНеЗаполнено(ТекГруппа) И ТекГруппа.ИспользоватьПредметыПисем Тогда
			Запись.Предмет = ?(ЗначениеНеЗаполнено(Предмет), "", Предмет);
		Иначе
			Запись.Предмет = "";
		КонецЕсли;
		Запись.КоличествоНеРассмотрено = ?(НеРассмотрено, 1, 0);
		Запись.ГраницаПрочитанности    = РассмотретьПосле;
		Запись.Период                  = Дата;
		
		Попытка
			Набор.Записать();
		Исключение
			СообщитьОбОшибке(ОписаниеОшибки(),, ШапкаСообщения);
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
		// Записи регистра для отображения соответствия Группа писем/Предмет
		Набор = Движения.ПредметыЭлектронныхПисем;
		
		Набор.Прочитать();
		
		Если мЭтоНовый Тогда
			СкрытыйПредмет = Ложь;
		Иначе
			Если Набор.Количество() > 0 Тогда
				СкрытыйПредмет = Набор[0].Скрытый;
			Иначе
				СкрытыйПредмет = Ложь;
			КонецЕсли; 
		КонецЕсли; 
		
		Набор.Очистить();
		
		Если УчетнаяЗапись.ИспользоватьКлассификациюПисемПоПредметам И НЕ ЗначениеНеЗаполнено(ТекГруппа) И ТекГруппа.ИспользоватьПредметыПисем Тогда
			Запись = Набор.Добавить();
			Запись.ГруппаПисемЭлектроннойПочты = ТекГруппа;
			Запись.Предмет                     = ?(ЗначениеНеЗаполнено(Предмет), "", Предмет);
			Запись.Период                      = Дата;
			Запись.Скрытый                     = СкрытыйПредмет;
		КонецЕсли; 
		
		Попытка
			Набор.Записать();
		Исключение
			СообщитьОбОшибке(ОписаниеОшибки(),, ШапкаСообщения);
			Отказ = Истина;
		КонецПопытки;
	
	КонецЕсли;
	
КонецПроцедуры

мСтруктураДоступа = ПолучитьДоступныеУчетныеЗаписи(глТекущийПользователь);
НеВыдаватьСообщенияПриЗаписиОбъекта = Ложь;
мРежимБезЗаписи = Ложь;
